In [7]:
from selenium import webdriver
from bs4 import BeautifulSoup
import pandas as pd

# Top 10 ODI teams in women’s cricket along with the records for matches, points and rating.

In [8]:
path= r"C:\Users\verma\Desktop\Selenium\chromedriver.exe"

In [9]:
driver= webdriver.Chrome(path)

In [76]:
driver.get('https://www.icc-cricket.com/rankings/womens/team-rankings/odi')

In [77]:
content=driver.page_source
soup=BeautifulSoup(content)
names=soup.findAll('span',attrs={'class':'u-show-phablet'})
print(len(names))
matches=soup.findAll('td',attrs={'class':'rankings-block__banner--matches'})
print(len(matches))
points=soup.findAll('td',attrs={'class':'rankings-block__banner--points'})
print(len(points))
rating=soup.findAll('td',attrs={'class':'rankings-block__banner--rating u-text-right'})
print(len(rating))

15
1
1
1

In [78]:
names

[<span class="u-show-phablet">AUS</span>,
 <span class="u-show-phablet">IND</span>,
 <span class="u-show-phablet">ENG</span>,
 <span class="u-show-phablet">SA</span>,
 <span class="u-show-phablet">NZ</span>,
 <span class="u-show-phablet">WI</span>,
 <span class="u-show-phablet">PAK</span>,
 <span class="u-show-phablet">BAN</span>,
 <span class="u-show-phablet">SL</span>,
 <span class="u-show-phablet">IRE</span>,
 <span class="icn icn-facebook-circle-small u-show-phablet"></span>,
 <span class="icn icn-twitter-circle-small u-show-phablet"></span>,
 <span class="icn icn-instagram-circle-small u-show-phablet"></span>,
 <span class="icn icn-youtube-circle-small u-show-phablet"></span>,
 <span class="icn icn-tiktok-circle-small u-show-phablet"></span>]

In [79]:
Names=[]
Matches=[]
Matches1=[]
Points=[]
Points1=[]
Rating=[]
Rating1=[]

In [80]:
for i in names:
    Names.append(i.text)
Names

['AUS',
 'IND',
 'ENG',
 'SA',
 'NZ',
 'WI',
 'PAK',
 'BAN',
 'SL',
 'IRE',
 '',
 '',
 '',
 '',
 '']

In [81]:
df=pd.DataFrame(Names)
df=df.rename({0:'Team'},axis=1)
df=df.iloc[0:10]
df

  Team
0  AUS
1  IND
2  ENG
3   SA
4   NZ
5   WI
6  PAK
7  BAN
8   SL
9  IRE

In [82]:
for i in matches:
    Matches.append(i.text)
Matches

['15']

In [83]:
df1=pd.DataFrame(Matches)
df1=df1.rename({0:'Matches'},axis=1)
df1

  Matches
0      15

In [84]:
for i in points:
    Points.append(i.text)
Points

['2,436']

In [85]:
df2=pd.DataFrame(Points)
df2=df2.rename({0:'Points'},axis=1)
df2

  Points
0  2,436

In [86]:
for i in rating:
    Rating.append(i.text)
Rating

['\n                            162\n                            \n\n']

In [87]:
df3=pd.DataFrame(Rating)
df3=df3.rename({0:'Rating'},axis=1)
df3=df3['Rating'].str.split('\n').str[1]
df3

0                                162
Name: Rating, dtype: object

In [88]:
df4=pd.DataFrame(df3)
df4

                            Rating
0                              162

In [89]:
Aus=pd.concat([df1,df2,df4],axis=1)
Aus

  Matches Points                           Rating
0      15  2,436                              162

In [90]:
content=driver.page_source
soup= BeautifulSoup(content)

matches1=soup.findAll('td',attrs={'class':'table-body__cell u-center-text'})
print(len(matches1))
points1=soup.findAll('td',attrs={'class':'table-body__cell u-center-text'})
print(len(points1))
rating1=soup.findAll('td',attrs={'class':'table-body__cell u-text-right rating'})
print(len(rating1))

18
18
9

In [92]:
matches1

[<td class="table-body__cell u-center-text">15</td>,
 <td class="table-body__cell u-center-text">1,812</td>,
 <td class="table-body__cell u-center-text">14</td>,
 <td class="table-body__cell u-center-text">1,670</td>,
 <td class="table-body__cell u-center-text">16</td>,
 <td class="table-body__cell u-center-text">1,713</td>,
 <td class="table-body__cell u-center-text">15</td>,
 <td class="table-body__cell u-center-text">1,384</td>,
 <td class="table-body__cell u-center-text">12</td>,
 <td class="table-body__cell u-center-text">1,025</td>,
 <td class="table-body__cell u-center-text">12</td>,
 <td class="table-body__cell u-center-text">927</td>,
 <td class="table-body__cell u-center-text">5</td>,
 <td class="table-body__cell u-center-text">306</td>,
 <td class="table-body__cell u-center-text">11</td>,
 <td class="table-body__cell u-center-text">519</td>,
 <td class="table-body__cell u-center-text">2</td>,
 <td class="table-body__cell u-center-text">25</td>]

In [93]:
points1

[<td class="table-body__cell u-center-text">15</td>,
 <td class="table-body__cell u-center-text">1,812</td>,
 <td class="table-body__cell u-center-text">14</td>,
 <td class="table-body__cell u-center-text">1,670</td>,
 <td class="table-body__cell u-center-text">16</td>,
 <td class="table-body__cell u-center-text">1,713</td>,
 <td class="table-body__cell u-center-text">15</td>,
 <td class="table-body__cell u-center-text">1,384</td>,
 <td class="table-body__cell u-center-text">12</td>,
 <td class="table-body__cell u-center-text">1,025</td>,
 <td class="table-body__cell u-center-text">12</td>,
 <td class="table-body__cell u-center-text">927</td>,
 <td class="table-body__cell u-center-text">5</td>,
 <td class="table-body__cell u-center-text">306</td>,
 <td class="table-body__cell u-center-text">11</td>,
 <td class="table-body__cell u-center-text">519</td>,
 <td class="table-body__cell u-center-text">2</td>,
 <td class="table-body__cell u-center-text">25</td>]

In [94]:
for i in matches1:
    Matches1.append(i.text)
Matches1

['15',
 '1,812',
 '14',
 '1,670',
 '16',
 '1,713',
 '15',
 '1,384',
 '12',
 '1,025',
 '12',
 '927',
 '5',
 '306',
 '11',
 '519',
 '2',
 '25']

In [97]:
df5=pd.DataFrame(Matches1)
df6=df5.iloc[0:18:2]
df6.index=range(9)
df6=df6.rename({0: 'Matches'},axis=1)
df6=df6.iloc[0:9]
df6

  Matches
0      15
1      14
2      16
3      15
4      12
5      12
6       5
7      11
8       2

In [98]:
for i in points1:
    Points1.append(i.text)
Points1

['15',
 '1,812',
 '14',
 '1,670',
 '16',
 '1,713',
 '15',
 '1,384',
 '12',
 '1,025',
 '12',
 '927',
 '5',
 '306',
 '11',
 '519',
 '2',
 '25']

In [99]:
df7=pd.DataFrame(Points1)
df8=df7.iloc[1:18:2]
df8.index=range(9)
df8=df8.rename({0: 'Points'},axis=1)
df8=df8.iloc[0:9]
df8

  Points
0  1,812
1  1,670
2  1,713
3  1,384
4  1,025
5    927
6    306
7    519
8     25

In [100]:
for i in rating1:
    Rating1.append(i.text)
Rating1

['121', '119', '107', '92', '85', '77', '61', '47', '13']

In [109]:
df9=pd.DataFrame(Rating1)
df9=df9.rename({0:'Rating'},axis=1)
df9

  Rating
0    121
1    119
2    107
3     92
4     85
5     77
6     61
7     47
8     13

In [110]:
ODI=pd.concat([df6,df8,df9],axis=1)
ODI

  Matches Points Rating
0      15  1,812    121
1      14  1,670    119
2      16  1,713    107
3      15  1,384     92
4      12  1,025     85
5      12    927     77
6       5    306     61
7      11    519     47
8       2     25     13

In [111]:
ODI1=pd.concat([Aus,ODI],axis=0)
ODI1.index=range(10)
ODI1

  Matches Points                           Rating
0      15  2,436                              162
1      15  1,812                              121
2      14  1,670                              119
3      16  1,713                              107
4      15  1,384                               92
5      12  1,025                               85
6      12    927                               77
7       5    306                               61
8      11    519                               47
9       2     25                               13

In [112]:
Womens_ODI=pd.concat([df,ODI1],axis=1)
Womens_ODI

  Team Matches Points                           Rating
0  AUS      15  2,436                              162
1  IND      15  1,812                              121
2  ENG      14  1,670                              119
3   SA      16  1,713                              107
4   NZ      15  1,384                               92
5   WI      12  1,025                               85
6  PAK      12    927                               77
7  BAN       5    306                               61
8   SL      11    519                               47
9  IRE       2     25                               13

# Top 10 women’s ODI players along with the records of their team and rating.

In [113]:
path = r"C:\Users\verma\Desktop\Selenium\chromedriver.exe"

In [114]:
driver = webdriver.Chrome(path)

In [115]:
driver.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/batting')

In [120]:
content=driver.page_source
soup=BeautifulSoup(content)
names=soup.findAll('div',attrs={'class':'rankings-block__banner--name-large'})
print(len(names))
team=soup.findAll('div',attrs={'class':'rankings-block__banner--nationality'})
print(len(team))
rating=soup.findAll('div',attrs={'class':'rankings-block__banner--rating'})
print(len(rating))

1
1
1

In [121]:
Names=[]
Names1=[]
Team=[]
Team1=[]
Rating=[]
Rating1=[]

In [122]:
for i in names:
    Names.append(i.text)
Names

['Meg Lanning']

In [123]:
df10=pd.DataFrame(Names)
df11=df10.rename({0:'Batsman Name'},axis=1)
df11

  Batsman Name
0  Meg Lanning

In [124]:
for i in team:
    Team.append(i.text)
Team

['\n\nAUS\n                    ']

In [125]:
df12=pd.DataFrame(Team)
df12[0] =df12[0].str.replace('\n',' ')
df12=df12.rename({0:'Team'},axis=1)
df12

                         Team
0    AUS

In [126]:
for i in rating:
    Rating.append(i.text)
Rating

['749']

In [127]:
df13=pd.DataFrame(Rating)
df13=df13.rename({0:'Rating'},axis=1)
df13

  Rating
0    749

In [128]:
player=pd.concat([df11,df12,df13],axis=1)
player

  Batsman Name                        Team Rating
0  Meg Lanning    AUS                         749

In [129]:
names1=soup.findAll('td',attrs={'class':'table-body__cell rankings-table__name name'})
print(len(names1))
team1=soup.findAll('td',attrs={'class':'table-body__cell nationality-logo rankings-table__team'})
print(len(team1))
rating1=soup.findAll('td',attrs={'table-body__cell rating'})
print(len(rating1))

99
99
99

In [131]:
for i in names1:
    Names1.append(i.text)
Names1

['\nStafanie Taylor\n',
 '\nAlyssa Healy\n',
 '\nSmriti Mandhana\n',
 '\nAmy Satterthwaite\n',
 '\nTammy Beaumont\n',
 '\nEllyse Perry\n',
 '\nLizelle Lee\n',
 '\nLaura Wolvaardt\n',
 '\nMithali Raj\n',
 '\nNatalie Sciver\n',
 '\nChamari Athapaththu\n',
 '\nRachael Haynes\n',
 '\nSuzie Bates\n',
 '\nSophie Devine\n',
 '\nHeather Knight\n',
 '\nBeth Mooney\n',
 '\nNahida Khan\n',
 '\nMignon du Preez\n',
 '\nHarmanpreet Kaur\n',
 '\nDane van Niekerk\n',
 '\nDeepti Sharma\n',
 '\nBismah Maroof\n',
 '\nJaveria Khan\n',
 '\nPoonam Raut\n',
 '\nMarizanne Kapp\n',
 '\nChloe-Lesleigh Tryon\n',
 '\nAmy Jones\n',
 '\nNicole Bolton\n',
 '\nKatie Perkins\n',
 '\nHayley Matthews\n',
 '\nDanielle Wyatt\n',
 '\nFargana Hoque\n',
 '\nSune Luus\n',
 '\nRumana Ahmed\n',
 '\nJemimah Rodriques\n',
 '\nAshleigh Gardner\n',
 '\nKatey Martin\n',
 '\nTrisha Chetty\n',
 '\nJess Jonassen\n',
 '\nShikha Pandey\n',
 '\nKatherine Brunt\n',
 '\nHarshitha Madavi\n',
 '\nFran Wilson\n',
 '\nJhulan Goswami\n',
 '\nRachel Priest\n',
 '\nMaddie Green\n',
 '\nShemaine Campbelle\n',
 '\nDilani Manodara\n',
 '\nNigar Sultana\n',
 '\nAliya Riaz\n',
 '\nChedean Nation\n',
 '\nKyshona Knight\n',
 '\nSidra Ameen\n',
 '\nNida Dar\n',
 '\nKycia Knight\n',
 '\nAndrie Steyn\n',
 '\nPriya Punia\n',
 '\nAmelia Kerr\n',
 '\nTaniya Bhatia\n',
 '\nNilakshi Silva\n',
 '\nSheneta Grimmond\n',
 '\nPoonam Yadav\n',
 '\nSalma Khatun\n',
 '\nLeigh Kasperek\n',
 '\nAnya Shrubsole\n',
 '\nNicola Carey\n',
 '\nUmaima Sohail\n',
 '\nAvanthika Mendis\n',
 '\nNatasha McLean\n',
 '\nSharmin Supta\n',
 '\nAnushka Sanjeewani\n',
 '\nKate Cross\n',
 '\nInoka Ranaweera\n',
 '\nStacy-Ann King\n',
 '\nRajeshwari Gayakwad\n',
 '\nMegan Schutt\n',
 '\nOshadi Ranasinghe\n',
 '\nLara Goodall\n',
 '\nHayley Jensen\n',
 '\nChinelle Henry\n',
 '\nNashra Sandhu\n',
 '\nShamilia Connell\n',
 '\nLea Tahuhu\n',
 '\nSanjida Islam\n',
 '\nSophie Ecclestone\n',
 '\nBernadine Bezuidenhout\n',
 '\nAfy Fletcher\n',
 '\nShabnim Ismail\n',
 '\nPanna Ghosh\n',
 '\nHolly Huddleston\n',
 '\nGeorgia Wareham\n',
 '\nHannah Rowe\n',
 '\nEkta Bisht\n',
 '\nAma Kanchana\n',
 '\nAnisa Mohammed\n',
 '\nAyabonga Khaka\n',
 '\nBritney Cooper\n',
 '\nTahlia McGrath\n',
 '\nSidra Nawaz\n',
 '\nStafanie Taylor\n',
 '\nAlyssa Healy\n',
 '\nSmriti Mandhana\n',
 '\nAmy Satterthwaite\n',
 '\nTammy Beaumont\n',
 '\nEllyse Perry\n',
 '\nLizelle Lee\n',
 '\nLaura Wolvaardt\n',
 '\nMithali Raj\n',
 '\nNatalie Sciver\n',
 '\nChamari Athapaththu\n',
 '\nRachael Haynes\n',
 '\nSuzie Bates\n',
 '\nSophie Devine\n',
 '\nHeather Knight\n',
 '\nBeth Mooney\n',
 '\nNahida Khan\n',
 '\nMignon du Preez\n',
 '\nHarmanpreet Kaur\n',
 '\nDane van Niekerk\n',
 '\nDeepti Sharma\n',
 '\nBismah Maroof\n',
 '\nJaveria Khan\n',
 '\nPoonam Raut\n',
 '\nMarizanne Kapp\n',
 '\nChloe-Lesleigh Tryon\n',
 '\nAmy Jones\n',
 '\nNicole Bolton\n',
 '\nKatie Perkins\n',
 '\nHayley Matthews\n',
 '\nDanielle Wyatt\n',
 '\nFargana Hoque\n',
 '\nSune Luus\n',
 '\nRumana Ahmed\n',
 '\nJemimah Rodriques\n',
 '\nAshleigh Gardner\n',
 '\nKatey Martin\n',
 '\nTrisha Chetty\n',
 '\nJess Jonassen\n',
 '\nShikha Pandey\n',
 '\nKatherine Brunt\n',
 '\nHarshitha Madavi\n',
 '\nFran Wilson\n',
 '\nJhulan Goswami\n',
 '\nRachel Priest\n',
 '\nMaddie Green\n',
 '\nShemaine Campbelle\n',
 '\nDilani Manodara\n',
 '\nNigar Sultana\n',
 '\nAliya Riaz\n',
 '\nChedean Nation\n',
 '\nKyshona Knight\n',
 '\nSidra Ameen\n',
 '\nNida Dar\n',
 '\nKycia Knight\n',
 '\nAndrie Steyn\n',
 '\nPriya Punia\n',
 '\nAmelia Kerr\n',
 '\nTaniya Bhatia\n',
 '\nNilakshi Silva\n',
 '\nSheneta Grimmond\n',
 '\nPoonam Yadav\n',
 '\nSalma Khatun\n',
 '\nLeigh Kasperek\n',
 '\nAnya Shrubsole\n',
 '\nNicola Carey\n',
 '\nUmaima Sohail\n',
 '\nAvanthika Mendis\n',
 '\nNatasha McLean\n',
 '\nSharmin Supta\n',
 '\nAnushka Sanjeewani\n',
 '\nKate Cross\n',
 '\nInoka Ranaweera\n',
 '\nStacy-Ann King\n',
 '\nRajeshwari Gayakwad\n',
 '\nMegan Schutt\n',
 '\nOshadi Ranasinghe\n',
 '\nLara Goodall\n',
 '\nHayley Jensen\n',
 '\nChinelle Henry\n',
 '\nNashra Sandhu\n',
 '\nShamilia Connell\n',
 '\nLea Tahuhu\n',
 '\nSanjida Islam\n',
 '\nSophie Ecclestone\n',
 '\nBernadine Bezuidenhout\n',
 '\nAfy Fletcher\n',
 '\nShabnim Ismail\n',
 '\nPanna Ghosh\n',
 '\nHolly Huddleston\n',
 '\nGeorgia Wareham\n',
 '\nHannah Rowe\n',
 '\nEkta Bisht\n',
 '\nAma Kanchana\n',
 '\nAnisa Mohammed\n',
 '\nAyabonga Khaka\n',
 '\nBritney Cooper\n',
 '\nTahlia McGrath\n',
 '\nSidra Nawaz\n']

In [132]:
df14=pd.DataFrame(Names1)
df14[0] =df14[0].str.replace('\n',' ')
df14=df14.rename({0:'Batsman Name'},axis=1)
df14=df14.iloc[0:9]
df14

          Batsman Name
0     Stafanie Taylor
1        Alyssa Healy
2     Smriti Mandhana
3   Amy Satterthwaite
4      Tammy Beaumont
5        Ellyse Perry
6         Lizelle Lee
7     Laura Wolvaardt
8         Mithali Raj

In [133]:
for i in team1:
    Team1.append(i.text)

In [134]:
Team1

['\n\nWI\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nSA\n',
 '\n\nSA\n',
 '\n\nIND\n',
 '\n\nENG\n',
 '\n\nSL\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nNZ\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nPAK\n',
 '\n\nSA\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nIND\n',
 '\n\nPAK\n',
 '\n\nPAK\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nSA\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nENG\n',
 '\n\nBAN\n',
 '\n\nSA\n',
 '\n\nBAN\n',
 '\n\nIND\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nSA\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nENG\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nSL\n',
 '\n\nBAN\n',
 '\n\nPAK\n',
 '\n\nWI\n',
 '\n\nWI\n',
 '\n\nPAK\n',
 '\n\nPAK\n',
 '\n\nWI\n',
 '\n\nSA\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nIND\n',
 '\n\nSL\n',
 '\n\nWI\n',
 '\n\nIND\n',
 '\n\nBAN\n',
 '\n\nNZ\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nPAK\n',
 '\n\nSL\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nSL\n',
 '\n\nWI\n',
 '\n\nIND\n',
 '\n\nAUS\n',
 '\n\nSL\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nPAK\n',
 '\n\nWI\n',
 '\n\nNZ\n',
 '\n\nBAN\n',
 '\n\nENG\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nSA\n',
 '\n\nBAN\n',
 '\n\nNZ\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nIND\n',
 '\n\nSL\n',
 '\n\nWI\n',
 '\n\nSA\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nPAK\n']

In [135]:
df15=pd.DataFrame(Team1)
df15[0] =df15[0].str.replace('\n',' ')
df15=df15.rename({0:'Team'},axis=1)
df15=df15.iloc[0:9]
df15

     Team
0     WI
1    AUS
2    IND
3     NZ
4    ENG
5    AUS
6     SA
7     SA
8    IND

In [136]:
for i in rating1:
    Rating1.append(i.text)
Rating1

['746',
 '741',
 '732',
 '723',
 '716',
 '691',
 '690',
 '689',
 '687',
 '670',
 '667',
 '655',
 '651',
 '649',
 '641',
 '603',
 '600',
 '597',
 '594',
 '585',
 '562',
 '553',
 '551',
 '543',
 '528',
 '514',
 '511',
 '484',
 '466',
 '461',
 '448',
 '445',
 '437',
 '437',
 '409',
 '399',
 '396',
 '385',
 '375',
 '371',
 '368',
 '353',
 '352',
 '325',
 '322',
 '320',
 '319',
 '319',
 '317',
 '299',
 '292',
 '281',
 '280',
 '280',
 '276',
 '275',
 '269',
 '269',
 '266',
 '261',
 '252',
 '248',
 '244',
 '240',
 '239',
 '236',
 '227',
 '226',
 '224',
 '221',
 '211',
 '208',
 '205',
 '201',
 '198',
 '195',
 '195',
 '191',
 '191',
 '188',
 '186',
 '186',
 '184',
 '181',
 '179',
 '177',
 '175',
 '170',
 '166',
 '164',
 '163',
 '162',
 '162',
 '161',
 '161',
 '151',
 '149',
 '145',
 '145']

In [137]:
df16=pd.DataFrame(Rating1)
df16=df16.rename({0:'Rating'},axis=1)
df16=df16.iloc[0:9]
df16

  Rating
0    746
1    741
2    732
3    723
4    716
5    691
6    690
7    689
8    687

In [138]:
player1=pd.concat([df14,df15,df16],axis=1)
player1

          Batsman Name    Team Rating
0     Stafanie Taylor      WI     746
1        Alyssa Healy     AUS     741
2     Smriti Mandhana     IND     732
3   Amy Satterthwaite      NZ     723
4      Tammy Beaumont     ENG     716
5        Ellyse Perry     AUS     691
6         Lizelle Lee      SA     690
7     Laura Wolvaardt      SA     689
8         Mithali Raj     IND     687

In [139]:
ODI_Batsmen=pd.concat([player,player1],axis=0)
ODI_Batsmen.index=range(10)
ODI_Batsmen

          Batsman Name                        Team Rating
0          Meg Lanning    AUS                         749
1     Stafanie Taylor                          WI     746
2        Alyssa Healy                         AUS     741
3     Smriti Mandhana                         IND     732
4   Amy Satterthwaite                          NZ     723
5      Tammy Beaumont                         ENG     716
6        Ellyse Perry                         AUS     691
7         Lizelle Lee                          SA     690
8     Laura Wolvaardt                          SA     689
9         Mithali Raj                         IND     687

# Top 10 women’s ODI all-rounder along with the records of their team and rating.

In [140]:
path = r"C:\Users\verma\Desktop\Selenium\chromedriver.exe"

In [141]:
driver = webdriver.Chrome(path)

In [142]:
driver.get('https://www.icc-cricket.com/rankings/womens/player-rankings/odi/all-rounder')

In [143]:
content=driver.page_source
soup=BeautifulSoup(content)
names=soup.findAll('div',attrs={'class':'rankings-block__banner--name-large'})
print(len(names))
team=soup.findAll('div',attrs={'class':'rankings-block__banner--nationality'})
print(len(team))
rating=soup.findAll('div',attrs={'class':'rankings-block__banner--rating'})
print(len(rating))

1
1
1

In [144]:
Names=[]
Names1=[]
Team=[]
Team=[]
Rating=[]
Rating1=[]

In [145]:
for i in names:
    Names.append(i.text)
Names

['Ellyse Perry']

In [146]:
df17=pd.DataFrame(Names)
df17=df17.rename({0:'Player Name'},axis=1)
df17

    Player Name
0  Ellyse Perry

In [147]:
for i in team:
    Team.append(i.text)
Team

['\n\nAUS\n                    ']

In [148]:
df18=pd.DataFrame(Team)
df18[0]=df18[0].str.replace('\n',' ')
df18=df18.rename({0:'Team'},axis=1)
df18

                         Team
0    AUS

In [149]:
for i in rating:
    Rating.append(i.text)
Rating

['460']

In [150]:
df19=pd.DataFrame(Rating)
df19=df19.rename({0:'Rating'},axis=1)
df19

  Rating
0    460

In [151]:
player=pd.concat([df17,df18,df19],axis=1)
player

    Player Name                        Team Rating
0  Ellyse Perry    AUS                         460

In [152]:
names1=soup.findAll('td',attrs={'class':'table-body__cell rankings-table__name name'})
print(len(names1))
team1=soup.findAll('td',attrs={'class':'table-body__cell nationality-logo rankings-table__team'})
print(len(team1))
rating1=soup.findAll('td',attrs={'class':'table-body__cell rating'})
print(len(rating1))

19
19
19

In [153]:
for i in names1:
    Names1.append(i.text)
Names1

['\nStafanie Taylor\n',
 '\nMarizanne Kapp\n',
 '\nDeepti Sharma\n',
 '\nDane van Niekerk\n',
 '\nJess Jonassen\n',
 '\nSophie Devine\n',
 '\nNatalie Sciver\n',
 '\nShikha Pandey\n',
 '\nKatherine Brunt\n',
 '\nJhulan Goswami\n',
 '\nAshleigh Gardner\n',
 '\nSune Luus\n',
 '\nRumana Ahmed\n',
 '\nHeather Knight\n',
 '\nHayley Matthews\n',
 '\nPoonam Yadav\n',
 '\nChamari Athapaththu\n',
 '\nAmelia Kerr\n',
 '\nAnya Shrubsole\n']

In [154]:
df20=pd.DataFrame(Names1)
df20[0]=df20[0].str.replace('\n',' ')
df20=df20.rename({0:'Player Name'},axis=1)
df20=df20.iloc[0:9]
df20

          Player Name
0    Stafanie Taylor
1     Marizanne Kapp
2      Deepti Sharma
3   Dane van Niekerk
4      Jess Jonassen
5      Sophie Devine
6     Natalie Sciver
7      Shikha Pandey
8    Katherine Brunt

In [155]:
for i in team1:
    Team1.append(i.text)
Team1

['\n\nWI\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nSA\n',
 '\n\nSA\n',
 '\n\nIND\n',
 '\n\nENG\n',
 '\n\nSL\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nNZ\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nPAK\n',
 '\n\nSA\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nIND\n',
 '\n\nPAK\n',
 '\n\nPAK\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nSA\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nENG\n',
 '\n\nBAN\n',
 '\n\nSA\n',
 '\n\nBAN\n',
 '\n\nIND\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nSA\n',
 '\n\nAUS\n',
 '\n\nIND\n',
 '\n\nENG\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nSL\n',
 '\n\nBAN\n',
 '\n\nPAK\n',
 '\n\nWI\n',
 '\n\nWI\n',
 '\n\nPAK\n',
 '\n\nPAK\n',
 '\n\nWI\n',
 '\n\nSA\n',
 '\n\nIND\n',
 '\n\nNZ\n',
 '\n\nIND\n',
 '\n\nSL\n',
 '\n\nWI\n',
 '\n\nIND\n',
 '\n\nBAN\n',
 '\n\nNZ\n',
 '\n\nENG\n',
 '\n\nAUS\n',
 '\n\nPAK\n',
 '\n\nSL\n',
 '\n\nWI\n',
 '\n\nBAN\n',
 '\n\nSL\n',
 '\n\nENG\n',
 '\n\nSL\n',
 '\n\nWI\n',
 '\n\nIND\n',
 '\n\nAUS\n',
 '\n\nSL\n',
 '\n\nSA\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nPAK\n',
 '\n\nWI\n',
 '\n\nNZ\n',
 '\n\nBAN\n',
 '\n\nENG\n',
 '\n\nNZ\n',
 '\n\nWI\n',
 '\n\nSA\n',
 '\n\nBAN\n',
 '\n\nNZ\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nIND\n',
 '\n\nSL\n',
 '\n\nWI\n',
 '\n\nSA\n',
 '\n\nWI\n',
 '\n\nAUS\n',
 '\n\nPAK\n',
 '\n\nWI\n',
 '\n\nSA\n',
 '\n\nIND\n',
 '\n\nSA\n',
 '\n\nAUS\n',
 '\n\nNZ\n',
 '\n\nENG\n',
 '\n\nIND\n',
 '\n\nENG\n',
 '\n\nIND\n',
 '\n\nAUS\n',
 '\n\nSA\n',
 '\n\nBAN\n',
 '\n\nENG\n',
 '\n\nWI\n',
 '\n\nIND\n',
 '\n\nSL\n',
 '\n\nNZ\n',
 '\n\nENG\n']

In [156]:
df21=pd.DataFrame(Team1)
df21[0]=df21[0].str.replace('\n',' ')
df21=df21.rename({0:'Team'},axis=1)
df21=df21.iloc[0:9]
df21

     Team
0     WI
1    AUS
2    IND
3     NZ
4    ENG
5    AUS
6     SA
7     SA
8    IND

In [157]:
for i in rating1:
    Rating1.append(i.text)
Rating1

['410',
 '389',
 '359',
 '335',
 '301',
 '289',
 '273',
 '250',
 '232',
 '224',
 '223',
 '188',
 '179',
 '178',
 '176',
 '168',
 '164',
 '158',
 '154']

In [158]:
df22=pd.DataFrame(Rating1)
df22=df22.rename({0:'Rating'},axis=1)
df22=df22.iloc[0:9]
df22

  Rating
0    410
1    389
2    359
3    335
4    301
5    289
6    273
7    250
8    232

In [159]:
player1=pd.concat([df20,df21,df22],axis=1)
player1

          Player Name    Team Rating
0    Stafanie Taylor      WI     410
1     Marizanne Kapp     AUS     389
2      Deepti Sharma     IND     359
3   Dane van Niekerk      NZ     335
4      Jess Jonassen     ENG     301
5      Sophie Devine     AUS     289
6     Natalie Sciver      SA     273
7      Shikha Pandey      SA     250
8    Katherine Brunt     IND     232

In [161]:
All_Rounder=pd.concat([player,player1],axis=0)
All_Rounder.index=range(10)
All_Rounder

          Player Name                        Team Rating
0        Ellyse Perry    AUS                         460
1    Stafanie Taylor                          WI     410
2     Marizanne Kapp                         AUS     389
3      Deepti Sharma                         IND     359
4   Dane van Niekerk                          NZ     335
5      Jess Jonassen                         ENG     301
6      Sophie Devine                         AUS     289
7     Natalie Sciver                          SA     273
8      Shikha Pandey                          SA     250
9    Katherine Brunt                         IND     232